microbuilder/LPC1114CodeBase/projectconfig.h
/**************************************************************************/
/*! 
    @file     projectconfig.h
    @author   K. Townsend (microBuilder.eu)

    @section LICENSE

    Software License Agreement (BSD License)

    Copyright (c) 2010, microBuilder SARL
    All rights reserved.

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the following conditions are met:
    1. Redistributions of source code must retain the above copyright
    notice, this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright
    notice, this list of conditions and the following disclaimer in the
    documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holders nor the
    names of its contributors may be used to endorse or promote products
    derived from this software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ''AS IS'' AND ANY
    EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
    WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE FOR ANY
    DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
    (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
    LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
    ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
    (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
    SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/
/**************************************************************************/

#ifndef _PROJECTCONFIG_H_
#define _PROJECTCONFIG_H_

#include "lpc111x.h"
#include "sysdefs.h"

/**************************************************************************

    This table tries to give an indication of which GPIO pins and 
    peripherals are used by the available drivers and SW examples.  Only
    dedicated GPIO pins available on the LPC1114 Reference Board are shown
    below.  Any unused peripheral blocks like I2C, SSP, ADC, etc., can
    also be used as GPIO if they are available.

                PORT 0    PORT 1    PORT 2               PORT 3
                =======   ======    =================    ======
                3 11      2 8 9     4 5 6 7 8 9 10 11    1 2 3

    SDCARD      . .       . . .     X X . . . . .  .     . . .
    PWM         . .       . . X     . . . . . . .  .     . . .
    STEPPER     . .       . . .     . . . . X X X  X     . . .
    CHIBI       . .       . . .     . . . . . . .  .     X X X
    ST7565      . .       . . .     X X X X X X .  .     . . .
    SSD1306     . .       . . .     X X X . X X .  .     . . .
    INTERFACE   . .       . . .     . . . . . . .  .     . . .
    BATTERY     . X       . . .     . . . . . . .  X     . . .
    VREG [1]    . .       . . .     . . . . . . X  .     . . .

                TIMERS                      SSP       ADC       UART
                ======================      ===       ======    ====
                16B0  16B1  32B0  32B1      0 1       1 2 6 7   0

    SDCARD      .     .     .     .         . X       . . . .   .
    PWM         .     X     .     .         . .       . . . .   .
    PMU [2]     .     .     X     .         . .       . . . .   .
    STEPPER     X     .     .     .         . .       . . . .   .
    CHIBI       x     .     .     .         X .       . . . .   .
    ST7565      .     .     .     .         . .       . . . .   .
    SSD1306     .     .     .     .         . .       . . . .   .
    INTERFACE   .     .     .     .         . .       . . . .   x

    [1]  Only relevant of the TPS780 is used.  The GPIO pin is used to
         switch from 3.3V to 2.2V depending on the MCUs operating mode.
    [2]  PMU uses 32-bit Timer 0 for SW wakeup from deep-sleep.  This timer
         can safely be used by other peripherals, but may need to be
         reconfigured when you wakeup from deep-sleep.

 **************************************************************************/


/*=========================================================================
    FIRMWARE VERSION SETTINGS
    -----------------------------------------------------------------------*/
    #define CFG_FIRMWARE_VERSION_MAJOR            (0)
    #define CFG_FIRMWARE_VERSION_MINOR            (6)
    #define CFG_FIRMWARE_VERSION_REVISION         (1)
/*=========================================================================*/


/*=========================================================================
    CORE CPU SETTINGS
    -----------------------------------------------------------------------

    CFG_CPU_CCLK    Value is for reference only.  'core/cpu/cpu.c' must
                    be modified to change the clock speed, but the value
                    should be indicated here since CFG_CPU_CCLK is used by
                    other peripherals to determine timing.

    Note:           At 36MHz 1 tick = ~27.777ns or 0.02777us
    -----------------------------------------------------------------------*/
    #define CFG_CPU_CCLK                (36000000)
/*=========================================================================*/


/*=========================================================================
    VOLTAGE REGULATOR
    -----------------------------------------------------------------------

    CFG_VREG_VCC_MAIN     Output voltage of the regulator in millivolts
    CFG_VREG_ALT_PRESENT  0 if no alternative voltage is available, 1
                          if it is available (TPS780, etc.)
    CFG_VREG_ALT_VCC      Alternate output voltage in millivolts on the
                          vreg in sleep or low-power mode.  (Only relevant
                          for dual-output regulators like the TPS780, etc.)
    CFG_VREG_ALT_PORT     GPIO port to enable alternate VREG output
    CFG_VREG_ALT_PIN      GPIO pin to enable alternate VREG output
    CFG_VREG_ALT_REG32    IOCON Register for the alt. output enable pin

    -----------------------------------------------------------------------*/
    #define CFG_VREG_VCC_MAIN           (3300)    // 3.3V * 1000
    #define CFG_VREG_ALT_PRESENT        (0)       // Must be 0 or 1
    #define CFG_VREG_ALT_VCC            (2200)    // TPS780 = 3.3V + 2.2V
    #define CFG_VREG_ALT_PORT           (2)
    #define CFG_VREG_ALT_PIN            (10)
    #define CFG_VREG_ALT_REG32          (IOCON_PIO2_10)
/*=========================================================================*/


/*=========================================================================
    BATTERY
    -----------------------------------------------------------------------

    CFG_BAT                   If this field is defined it indicates
                              that a user selectable voltage divider is
                              connected to the batter/power supply
    CFG_BAT_ENPORT            The port to enable to battery voltage divider
    CFG_BAT_ENPIN             The pin to enable the battery voltage divider
    CFG_BAT_ADC               The adc port where that the battery is connected
    CFG_BAT_SUPPLYVOLTAGE     The regulated supply voltage in millivolts
    CFG_BAT_MULTIPLIER        Multiplier to convert the adc result to
                              battery voltage - ((R1 + R2) / R2) * 1000

    Note:                     For an example of using this information to
                              determine the battery/power-supply voltage
                              level see 'projects/commands/cmd_sysinfo.c'

