microbuilder/LPC1114CodeBase/projectconfig.h
    Note:                     LPC1114 @ 36MHz and the ST7565 with the
                              backlight enabled consumes ~35mA

    DEPENDENCIES:             ST7565 requires the use of pins 2.4-9.
    DEPENDENCIES:             SSD1306 requires the use of pins 2.4-9.
    -----------------------------------------------------------------------*/
    // #define CFG_ST7565
    // #define CFG_SSD1306
/*=========================================================================*/


/*=========================================================================
    RSA Encryption
    -----------------------------------------------------------------------

    CFG_RSA                     If defined, support for basic RSA
                                encryption will be included.
    CFG_RSA_BITS                Indicates the number of bits used for
                                RSA encryption keys.  To keep code size
                                reasonable, RSA encryption is currently
                                limited to using 64-bit or 32-bit numbers,
                                with 64-bit providing higher security, and
                                32-bit providing smaller encrypted text
                                size.  Please note that Printf can not be
                                used to display 64-bit values (%lld)!
    -----------------------------------------------------------------------*/
    // #define CFG_RSA
    #define CFG_RSA_BITS                  (32)
/*=========================================================================*/



// #####################
// Config error-checking
// #####################
#ifdef CFG_INTERFACE
  #ifndef CFG_PRINTF_UART
    #error "CFG_INTERFACE can not be used without CFG_PRINTF_UART"
  #endif
#endif

#ifdef CFG_CHIBI
  #if !defined CFG_I2CEEPROM
    #error "CFG_CHIBI requires CFG_I2CEEPROM to store and retrieve addresses"
  #endif
  #ifdef CFG_STEPPER
    #error "CFG_CHIBI and CFG_STEPPER can not be defined at the same time since they both use CT16B0"
  #endif
  #if CFG_CHIBI_PROMISCUOUS != 0 && CFG_CHIBI_PROMISCUOUS != 1
    #error "CFG_CHIBI_PROMISCUOUS must be equal to either 1 or 0"
  #endif
#endif

#ifdef CFG_ST7565
  #ifdef CFG_STEPPER
    #error "CFG_ST7565 and CFG_STEPPER can not be defined at the same time since they both use pins 2.8 and 2.9"
  #endif
  #ifdef CFG_SSD1306
    #error "CFG_ST7565 and CFG_SSD1306 can not be defined at the same time"
  #endif
#endif

#ifdef CFG_RSA
  #if CFG_RSA_BITS != 64 && CFG_RSA_BITS != 32
    #error "CFG_RSA_BITS must be equal to either 32 or 64."
  #endif
#endif

#if CFG_VREG_ALT_PRESENT != 1 && CFG_VREG_ALT_PRESENT != 0
  #error "CFG_VREG_ALT_PRESENT must be equal to either 1 or 0"
#endif

#endif


